emacs.d.org
* Package management

  [[https://github.com/raxod502/straight.el][=straight.el=]] is a package manager for Emacs that locks package versions and downloads packages from Git repositories.
  The [[https://github.com/raxod502/straight.el#getting-started][Getting started]] section in its README provides the bootstrap code to place inside =init.el=:

  #+begin_src emacs-lisp :tangle init.el
    ;; Package management: straight.el
    (defvar bootstrap-version)
    (let ((bootstrap-file
	   (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	  (bootstrap-version 5))
      (unless (file-exists-p bootstrap-file)
	(with-current-buffer
	    (url-retrieve-synchronously
	     "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	     'silent 'inhibit-cookies)
	  (goto-char (point-max))
	  (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage))
  #+end_src

  To disable =package.el= (Emacs' default package manager) in favor of using =straight.el=, turn off =package-enable-at-startup= in =early-init.el=:

  #+begin_src emacs-lisp :tangle early-init.el
    ;; Disable package.el in favor of straight.el
    (setq package-enable-at-startup nil)
  #+end_src

  To install a package for the current session, execute the =straight-use-package= command:

  #+begin_example
    M-x straight-use-package <RET> evil <RET>
  #+end_example

  To continue using the package in future sessions, add the =straight-use-package= call to =~/.emacs/init.el=:

  #+begin_src emacs-lisp
    (straight-use-package 'evil)
  #+end_src

* Evil

  [[https://github.com/emacs-evil/evil][Evil]] is a Vim emulator for emacs.
  Install it with =straight.el=, and turn =evil-mode= on:

  #+begin_src emacs-lisp :tangle init.el
    ;; Vim emulation: evil
    (straight-use-package 'evil)
    (evil-mode 1)
  #+end_src

** Evil collection

   [[https://github.com/emacs-evil/evil-collection][Evil collection]] is a collection of bindings for plugins.

   #+begin_src emacs-lisp :tangle init.el
     ;; Vim bindings for plugins: evil-collection
     (straight-use-package 'evil-collection)
     (evil-collection-init)
   #+end_src

* Magit

  [[https://magit.vc][Magit]] is an interface to Git.

  #+begin_src emacs-lisp :tangle init.el
    ;; Git: magit
    (straight-use-package 'magit)
  #+end_src

* Elixir

  #+begin_src emacs-lisp :tangle init.el
    ;; Elixir: elixir-mode
    (straight-use-package 'elixir-mode)
  #+end_src

  Automatically format Elixir files on save.

  #+begin_src emacs-lisp :tangle init.el
    ;; Format Elixir files on save
    (add-hook 'elixir-mode-hook
	      (lambda () (add-hook 'before-save-hook 'elixir-format nil t)))
  #+end_src
